{
  "movies": [
    {
      "title": "Rogue One: A Star Wars Story",
      "poster_path": "https://image.tmdb.org/t/p/w154/qjiskwlV1qQzRCjpV0cL9pEMF9a.jpg",
      "overview": "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.",
      "release_date": "12/14/2016",
      "rating": 0,
      "_id": 1
    },
    {
      "title": "The Matrix",
      "poster_path": "https://image.tmdb.org/t/p/w154/lZpWprJqbIFpEV5uoHfoK0KCnTW.jpg",
      "overview": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
      "release_date": "03/30/1999",
      "rating": 0,
      "_id": 2
    },
    {
      "title": "Legally Blonde",
      "poster_path": "https://image.tmdb.org/t/p/w154/1gAnkZNAd3HqgWL7aqSOQFwt7D1.jpg",
      "overview": "Elle Woods has it all. She's the president of her sorority, a Hawaiian Tropic girl, Miss June in her campus calendar, and, above all, a natural blonde. She dates the cutest fraternity boy on campus and wants nothing more than to be Mrs. Warner Huntington III. But, there's just one thing stopping Warner from popping the question: Elle is too blonde.",
      "release_date": "07/13/2001",
      "rating": 0,
      "_id": 3
    },
    {
      "title": "Man of Steel",
      "poster_path": "https://image.tmdb.org/t/p/w154/xWlaTLnD8NJMTT9PGOD9z5re1SL.jpg",
      "overview": "A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.",
      "release_date": "06/12/2013",
      "rating": 0,
      "_id": 4
    },
    {
      "title": "The Dark Knight",
      "poster_path": "https://image.tmdb.org/t/p/w154/1hRoyzDtpgMU7Dz4JF22RANzQO7.jpg",
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "release_date": "07/16/2008",
      "rating": 0,
      "_id": 5
    }
  ]
}